Revit 2026 API

# MirrorMirrorColorByObject Property

---

The property labeled "Color By Object" from the "Mirror" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MirrorColorByObject { get; }
```
```vb
Public Shared ReadOnly Property MirrorColorByObject As String
	Get
```
```cpp
public:
static property String^ MirrorColorByObject {
	String^ get ();
}
```
```fsharp
static member MirrorColorByObject : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

Mirror Class

Autodesk.Revit.DB.Visual Namespace